valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
#include "ILI9341_FSMC.h"
#include "XPT2046.h"
#include "font.h"
#include "pressure_control_config.h"
#include "advanced_pressure_control.h"
#include "stm32f4xx_hal.h"
#include <math.h>
#include <string.h>
#include <stdio.h>

/* External handles */
extern SPI_HandleTypeDef hspi1;
extern ADC_HandleTypeDef hadc3;

/* XPT2046 Commands */
#define XPT2046_CMD_READ_X      0x90  /* Read X position */
#define XPT2046_CMD_READ_Y      0xD0  /* Read Y position */

/* FSMC init funksiyası main.c-də var, burada dublikat yox */

/* Sadə yazma köməkçiləri */
static inline void lcd_write_command(uint16_t cmd)
{
    LCD_REG = cmd;
    __DSB();  /* Data Synchronization Barrier - yazmanın tamamlanmasını təmin et */
}
static inline void lcd_write_data(uint16_t data)
{
    LCD_RAM = data;
    __DSB();  /* Data Synchronization Barrier - yazmanın tamamlanmasını təmin et */
}

/* ------------------ ILI9341 INIT ------------------ */
void ILI9341_Init(void)
{
    /* Backlight ON */
    HAL_GPIO_WritePin(LCD_LIG_GPIO_Port, LCD_LIG_Pin, GPIO_PIN_SET);
    HAL_Delay(10);

    /* HW reset pulse */
    HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_RESET);
    HAL_Delay(10);
    HAL_GPIO_WritePin(LCD_RST_GPIO_Port, LCD_RST_Pin, GPIO_PIN_SET);
    HAL_Delay(120);

    /* ILI9341 initialization sequence - tam siyahı */
    lcd_write_command(0x01); HAL_Delay(10);    /* Software Reset */
    
    lcd_write_command(0x28);                  /* Display OFF */
    HAL_Delay(10);
    
    /* Power Control 1 */
    lcd_write_command(0xCB);
    lcd_write_data(0x39);
    lcd_write_data(0x2C);
    lcd_write_data(0x00);
    lcd_write_data(0x34);
    lcd_write_data(0x02);
    HAL_Delay(10);
    
    /* Power Control 2 */
    lcd_write_command(0xCF);
    lcd_write_data(0x00);
    lcd_write_data(0xC1);
    lcd_write_data(0x30);
    HAL_Delay(10);
    
    /* Driver Timing Control A */
    lcd_write_command(0xE8);
    lcd_write_data(0x85);
    lcd_write_data(0x00);
    lcd_write_data(0x78);
    HAL_Delay(10);
    
    /* Driver Timing Control B */
    lcd_write_command(0xEA);
    lcd_write_data(0x00);
    lcd_write_data(0x00);
    HAL_Delay(10);
    
    /* Power on Sequence Control */
    lcd_write_command(0xED);
    lcd_write_data(0x64);
    lcd_write_data(0x03);
    lcd_write_data(0x12);
    lcd_write_data(0x81);
    HAL_Delay(10);
    
    /* Pump ratio control */
    lcd_write_command(0xF7);
    lcd_write_data(0x20);
    HAL_Delay(10);
    
    /* Power Control 1 */
    lcd_write_command(0xC0);
    lcd_write_data(0x23);
    HAL_Delay(10);
    
    /* Power Control 2 */
    lcd_write_command(0xC1);
    lcd_write_data(0x10);
    HAL_Delay(10);
    
    /* VCOM Control 1 */
    lcd_write_command(0xC5);
    lcd_write_data(0x3E);
    lcd_write_data(0x28);
    HAL_Delay(10);
    
    /* VCOM Control 2 */
    lcd_write_command(0xC7);
    lcd_write_data(0x86);
    HAL_Delay(10);
    
    /* Memory Access Control - DÜZƏLİŞ: Düzgün landscape rejimi */
    lcd_write_command(0x36);
    lcd_write_data(0x48);  /* MY=1, MX=0, MV=0, ML=0, BGR=1, MH=0 (Landscape 320x240) */
    HAL_Delay(10);
    
    /* Pixel Format Set */
    lcd_write_command(0x3A);
    lcd_write_data(0x55);  /* 16-bit/pixel */
    HAL_Delay(10);
    
    /* Frame Rate Control */
    lcd_write_command(0xB1);
    lcd_write_data(0x00);
    lcd_write_data(0x18);
    HAL_Delay(10);
    
    /* Display Function Control */
    lcd_write_command(0xB6);
    lcd_write_data(0x08);
    lcd_write_data(0x82);
    lcd_write_data(0x27);
    HAL_Delay(10);
    
    /* 3G Gamma Control */
    lcd_write_command(0xF2);
    lcd_write_data(0x00);
    HAL_Delay(10);
    
    /* Gamma Set */
    lcd_write_command(0x26);
    lcd_write_data(0x01);
    HAL_Delay(10);
    
    /* Positive Gamma Correction */
    lcd_write_command(0xE0);
    lcd_write_data(0x0F);
    lcd_write_data(0x31);
    lcd_write_data(0x2B);
    lcd_write_data(0x0C);
    lcd_write_data(0x0E);
    lcd_write_data(0x08);
    lcd_write_data(0x4E);
    lcd_write_data(0xF1);
    lcd_write_data(0x37);
    lcd_write_data(0x07);
    lcd_write_data(0x10);
    lcd_write_data(0x03);
    lcd_write_data(0x0E);
    lcd_write_data(0x09);
    lcd_write_data(0x00);
    HAL_Delay(10);
    
    /* Negative Gamma Correction */
    lcd_write_command(0xE1);
    lcd_write_data(0x00);
    lcd_write_data(0x0E);
    lcd_write_data(0x14);
    lcd_write_data(0x03);
    lcd_write_data(0x11);
    lcd_write_data(0x07);
    lcd_write_data(0x31);
    lcd_write_data(0xC1);
    lcd_write_data(0x48);
    lcd_write_data(0x08);
    lcd_write_data(0x0F);
    lcd_write_data(0x0C);
    lcd_write_data(0x31);
    lcd_write_data(0x36);
    lcd_write_data(0x0F);
    HAL_Delay(10);
    
    /* Sleep Out */
    lcd_write_command(0x11);
    HAL_Delay(120);  /* CRITICAL: Wait for sleep out to complete */
    
    /* Display ON */
    lcd_write_command(0x29);
    HAL_Delay(100);  /* DÜZƏLİŞ: 20ms-dən 100ms-ə artırıldı - display stabilləşməsi üçün */
    
    /* Normal Display Mode ON */
    lcd_write_command(0x13);
    HAL_Delay(50);   /* DÜZƏLİŞ: 10ms-dən 50ms-ə artırıldı */
}

/* ------------------ Ekranı rənglə doldur ------------------ */
void ILI9341_FillScreen(uint16_t color)
{
    uint32_t px = 320UL * 240UL;

    /* RAM write (CASET/RASET landscape 320x240) */
    lcd_write_command(0x2A);  /* Column addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x01); lcd_write_data(0x3F); /* 319 */

    lcd_write_command(0x2B);  /* Row addr set */
    lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_data(0x00); lcd_write_data(0xEF); /* 239 */

    lcd_write_command(0x2C);  /* RAMWR */

    while (px--) {
        LCD_RAM = color;
    }
}

/* ------------------ Pixel çək ------------------ */
void ILI9341_DrawPixel(uint16_t x, uint16_t y, uint16_t color)
{
    if (x >= 320 || y >= 240) return;

    /* Set address */
    lcd_write_command(0x2A);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);
    lcd_write_data(x >> 8); lcd_write_data(x & 0xFF);

    lcd_write_command(0x2B);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);
    lcd_write_data(y >> 8); lcd_write_data(y & 0xFF);

    lcd_write_command(0x2C);
    LCD_RAM = color;
}

/* ------------------ Düzbucaqlı çək ------------------ */
void ILI9341_DrawRectangle(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
    for (uint16_t i = 0; i < height; i++) {
        for (uint16_t j = 0; j < width; j++) {
            ILI9341_DrawPixel(x + j, y + i, color);
        }
    }
}

