valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    /* Qırmızı fon */
    ILI9341_FillScreen(ILI9341_COLOR_RED);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "TEST", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Test məzmunu */
    ILI9341_DrawString(50, 60, "Color Test: RED", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 80, "Font Test: ABC abc 123", ILI9341_COLOR_WHITE, 0x0000, 2);
    ILI9341_DrawString(50, 100, "Touch Test: Touch buttons", ILI9341_COLOR_WHITE, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* Info səhifəsi */
void ILI9341_ShowInfoPage(void)
{
    current_page = 3;
    
    /* Sarı fon */
    ILI9341_FillScreen(ILI9341_COLOR_YELLOW);
    
    /* Başlıq */
    ILI9341_DrawRectangle(10, 10, 300, 30, ILI9341_COLOR_BLUE);
    ILI9341_DrawRectangle(12, 12, 296, 26, ILI9341_COLOR_WHITE);
    ILI9341_DrawString(140, 20, "INFO", ILI9341_COLOR_BLUE, 0xFFFF, 2);
    
    /* Məlumat */
    ILI9341_DrawString(50, 60, "STM32F407ZGT6", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 80, "TFT 3.2 LCD", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 100, "ILI9341 Driver", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 120, "XPT2046 Touch", ILI9341_COLOR_BLACK, 0x0000, 2);
    ILI9341_DrawString(50, 140, "FSMC Interface", ILI9341_COLOR_BLACK, 0x0000, 2);
    
    /* Geri düyməsi */
    Button_t back_btn = {20, 200, 280, 35, ILI9341_COLOR_RED, "Back"};
    ILI9341_DrawButton(&back_btn);
    ILI9341_DrawString(120, 215, "BACK TO MENU", ILI9341_COLOR_WHITE, 0x0000, 2);
}

/* ------------------ Font funksiyaları ------------------ */
void ILI9341_DrawChar(uint16_t x, uint16_t y, char c, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    if (c < 32 || c > 126) return;
    
    const uint8_t *font_data = &font_7x10.data[(c - 32) * 7];
    
    for (uint8_t i = 0; i < 7; i++) {
        uint8_t line = font_data[i];
        for (uint8_t j = 0; j < 10; j++) {
            if (line & (1 << j)) {
                // Pixel çək
                for (uint8_t sx = 0; sx < size; sx++) {
                    for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, color);
                    }
                }
            } else if (bgcolor != color) {
                // Background pixel çək
            for (uint8_t sx = 0; sx < size; sx++) {
                for (uint8_t sy = 0; sy < size; sy++) {
                        ILI9341_DrawPixel(x + i * size + sx, y + j * size + sy, bgcolor);
                    }
                }
            }
        }
    }
}

void ILI9341_DrawString(uint16_t x, uint16_t y, const char *str, uint16_t color, uint16_t bgcolor, uint8_t size)
{
    uint16_t start_x = x;
    while (*str) {
        if (*str == '\n') {
            y += 12 * size; // 10 + 2 space
            x = start_x;
        } else {
            ILI9341_DrawChar(x, y, *str, color, bgcolor, size);
            x += 8 * size; // 7 + 1 space
        }
        str++;
    }
}

/* ------------------ Pressure Control System ------------------ */

/* Global variables for pressure control system */
static uint8_t pressure_control_page = 0; // 0=main, 1=menu, 7=touch_cal, 8=pressure_cal, 9=pid_tune
// REMOVED: 2=pwm, 3=pressure_limit, 4=drv, 5=zme, 6=motor - PWM və PRES LIM bölmələri silindi
static float current_pressure = 0.0;
// REMOVED: float pressure_limit = 300.0; // SİLİNDİ - artıq g_system_status.target_pressure istifadə edilir
static float drv_percent = 0.0;
static float zme_percent = 0.0;
static float motor_percent = 0.0;

/* PWM control variables */
static float drv_duty_cycle = 50.0;
static float drv_frequency = 1000.0;
static float zme_duty_cycle = 50.0;
static float motor_duty_cycle = 50.0;
static float motor_frequency = 1000.0;

/* Pressure sensor calibration variables */
/* Note: These are NOT static so AdvancedPressureControl can access them */
float min_voltage = 0.5;      /* Minimum voltage (0.5V) */
float max_voltage = 5.0;     /* Maximum voltage (5.0V) */
float min_pressure = 0.0;     /* DÜZƏLİŞ: Minimum pressure (0.0 bar - sıfır təzyiq) */
float max_pressure = 300.0;   /* Maximum pressure (300.0 bar) */
/* STM32F4 ADC referans: 3.3V, ADC = (Voltage / 3.3) * 4095 */
uint16_t adc_min = 620;       /* DÜZƏLİŞ: ADC at 0.5V = (0.5/3.3)*4095 ≈ 620 (əvvəl 410 idi) */
uint16_t adc_max = 4095;      /* ADC at 5.0V = (5.0/3.3)*4095 ≈ 6204 (saturasiya, 4095-də məhdudlaşır) */
static uint8_t calibration_mode = 0; /* 0=normal, 1=calibrate min, 2=calibrate max */

/* Ensure we never overwrite valid calibration data with defaults */
static bool ILI9341_IsPressureCalibrationValid(const CalibrationData_t* cal)
{
    if (cal == NULL || !cal->calibrated) {
        return false;
    }

    if (!isfinite(cal->adc_min) || !isfinite(cal->adc_max) ||
        !isfinite(cal->pressure_min) || !isfinite(cal->pressure_max)) {
        return false;
    }

    if (cal->adc_min < 0.0f || cal->adc_min > (float)ADC_MAX) {
        return false;
    }

    if (cal->adc_max <= cal->adc_min || cal->adc_max > (float)ADC_MAX) {
        return false;
    }

    if (cal->pressure_max <= cal->pressure_min) {
        return false;
    }

    return true;
}

/* Precise conversion constants */
// DÜZƏLİŞ: P_PER_COUNT və P_OFFSET silindi - artıq g_calibration strukturundan istifadə edilir
// Bütün təzyiq konversiyaları Advanced sistemin g_calibration strukturundan istifadə edir
static const float BAR_PER_VOLT = 66.3228f; /* bar per volt (display only) */
static const float V_PER_COUNT = 0.00158f;  /* volt per ADC count (display only) */

/* Motor/DRV/ZME conversion constants */
static const float MOTOR_BAR_PER_PERCENT = 3.144f;    /* bar per 1% motor */
static const float MOTOR_PERCENT_PER_BAR = 0.3181f;  /* % per 1 bar motor */
static const float DRV_BAR_PER_PERCENT = 10.48f;     /* bar per 1% DRV (10-40% range) */
static const float DRV_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar DRV */
static const float ZME_BAR_PER_PERCENT = 10.48f;     /* bar per 1% ZME (0-30% range) */
static const float ZME_PERCENT_PER_BAR = 0.09545f;   /* % per 1 bar ZME */

/* Pressure limits for ZME control (separate from sensor calibration) */
static float zme_min_pressure = 3.5f;   /* minimum system pressure for ZME (bar) */
static float zme_max_pressure = 200.0f;  /* maximum system pressure for ZME (bar) */
static float zme_frequency = 1000.0f;  /* ZME PWM frequency in Hz */

