valehabasovv-max/stm32f407zgt6_Valeh/Core/Src/ILI9341_FSMC.c
    // Info: ZME and DRV use same PID parameters
    ILI9341_DrawString(20, 185, "ZME & DRV: Same PID", ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    
    // Back and Save
    ILI9341_DrawControlButton(20, 200, 80, 30, ILI9341_COLOR_WHITE, "Back", 1);
    ILI9341_DrawControlButton(220, 200, 80, 30, ILI9341_COLOR_WHITE, "Save", 1);
}

/* Update pressure display */
void ILI9341_UpdatePressureDisplay(float pressure)
{
    current_pressure = pressure;
    
    if (pressure_control_page == 0) {
        /* Clean pressure display - no debug clutter */
        
        /* Update pressure value with clean formatting */
        char pressure_str[25];
        if (current_pressure < 10.0) {
            sprintf(pressure_str, "%.2f BAR", current_pressure);
        } else if (current_pressure < 100.0) {
            sprintf(pressure_str, "%.1f BAR", current_pressure);
        } else {
            sprintf(pressure_str, "%.0f BAR", current_pressure);
        }
        
        /* Clear the old text area and draw new text */
        ILI9341_DrawRectangle(130, 125, 100, 20, ILI9341_COLOR_BLACK);
        ILI9341_DrawString(130, 125, pressure_str, ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 2);
        
        /* Update safety status (based on target pressure) */
        SystemStatus_t* status = AdvancedPressureControl_GetStatus();
        ILI9341_DrawRectangle(200, 140, 100, 15, ILI9341_COLOR_BLACK);
        if (current_pressure > (status->target_pressure + 10.0f)) {
            ILI9341_DrawString(200, 140, "OVER LIMIT!", ILI9341_COLOR_RED, ILI9341_COLOR_BLACK, 1);
        } else if (current_pressure > status->target_pressure) {
            ILI9341_DrawString(200, 140, "NEAR LIMIT", ILI9341_COLOR_YELLOW, ILI9341_COLOR_BLACK, 1);
        } else {
            ILI9341_DrawString(200, 140, "SAFE", ILI9341_COLOR_GREEN, ILI9341_COLOR_BLACK, 1);
        }
        
        /* Update the pressure gauge arc only (not the entire circle) */
        ILI9341_DrawPressureGauge(160, 80, 35, current_pressure, 300.0);
    }
}

/* Update percentage displays */
void ILI9341_UpdatePercentageDisplays(float drv_percent_val, float zme_percent_val, float motor_percent_val)
{
    drv_percent = drv_percent_val;
    zme_percent = zme_percent_val;
    motor_percent = motor_percent_val;
    
    if (pressure_control_page == 0) {
        char drv_str[20], zme_str[20], motor_str[20];
        
        // Clear old text area first
        ILI9341_DrawRectangle(10, 210, 80, 15, ILI9341_COLOR_BLACK);
        ILI9341_DrawRectangle(110, 210, 80, 15, ILI9341_COLOR_BLACK);
        ILI9341_DrawRectangle(210, 210, 80, 15, ILI9341_COLOR_BLACK);
        
        sprintf(drv_str, "DRV: %.2f%%", drv_percent);
        sprintf(zme_str, "ZME: %.2f%%", zme_percent);
        sprintf(motor_str, "M: %.1f%%", motor_percent);
        
        ILI9341_DrawString(10, 210, drv_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(110, 210, zme_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
        ILI9341_DrawString(210, 210, motor_str, ILI9341_COLOR_CYAN, ILI9341_COLOR_BLACK, 1);
    }
}

/* Handle touch for pressure control system */
void ILI9341_HandlePressureControlTouch(void)
{
    uint16_t raw_x, raw_y, screen_x, screen_y;
    
    if (XPT2046_IsTouched()) {
        if (XPT2046_GetCoordinates(&raw_x, &raw_y)) {
            XPT2046_ConvertToScreen(raw_x, raw_y, &screen_x, &screen_y);
            
            /* Clean touch handling - no debug clutter */
            
            /* Clean interface - no debug clutter */
            
            switch (pressure_control_page) {
                case 0: // Main page
                    /* Menu button */
                    if (screen_x >= 15 && screen_x <= 85 && screen_y >= 150 && screen_y <= 185) {
                        ILI9341_ShowMenuPage();
                    }
                    /* Auto button - REMOVED (AutoMode deleted) */
                    /* Manual button - REMOVED (Manual mode deleted) */
                    /* Stop button - REMOVED (Stop button deleted) */
                    break;
                    
                case 1: // Menu page
                    // REMOVED: PWM button - PWM bölməsi silindi
                    // REMOVED: Pressure Limit button - PRES LIM bölməsi silindi
                    
                    // Pressure Sensor Calibration button (80-240 x, 90-125 y)
                    if (screen_x >= 80 && screen_x <= 240 && screen_y >= 90 && screen_y <= 125) {
                        ILI9341_ShowPressureCalibrationPage();
                    }
                    // PID Tuning button (80-240 x, 135-170 y)
                    else if (screen_x >= 80 && screen_x <= 240 && screen_y >= 135 && screen_y <= 170) {
                        ILI9341_ShowPIDTuningPage();
                    }
                    /* Back button - moved to upper left */
                    else if (screen_x >= 20 && screen_x <= 80 && screen_y >= 20 && screen_y <= 50) {
                        ILI9341_ShowPressureControlMain();
                    }
                    break;
                    
                // REMOVED: case 2 (PWM page), case 4 (DRV PWM page), case 5 (ZME PWM page), case 6 (Motor PWM page)
                // PWM bölməsi tamamilə silindi
                // REMOVED: case 3 (Pressure limit page) - PRES LIM bölməsi silindi
                    
                case 7: // Touch Calibration page
                    // Mode buttons
                    if (screen_x >= 20 && screen_x <= 80 && screen_y >= 130 && screen_y <= 160) {
                        XPT2046_SetCoordMode(0);
                    }
                    else if (screen_x >= 90 && screen_x <= 150 && screen_y >= 130 && screen_y <= 160) {
                        XPT2046_SetCoordMode(1);
                    }
                    else if (screen_x >= 160 && screen_x <= 220 && screen_y >= 130 && screen_y <= 160) {
                        XPT2046_SetCoordMode(2);
                    }
                    else if (screen_x >= 230 && screen_x <= 290 && screen_y >= 130 && screen_y <= 160) {
                        XPT2046_SetCoordMode(3);
                    }
                    // Back button
                    else if (screen_x >= 20 && screen_x <= 100 && screen_y >= 200 && screen_y <= 230) {
                        ILI9341_ShowMenuPage();
                    }
                    break;
                    
                case 8: // Pressure Sensor Calibration page
                    /* Clean touch handling - no debug clutter */
                    
